{
  "Acheri": {
    "Origin": "Native American folklore",
    "Killing": "Bring sickness to humans, particularly children",
    "Description": "Acheri is a spirit in Native American folklore, often depicted as a ghostly figure of a young girl who brings sickness and death to those she encounters."
  },
  "Akrida": {
    "Origin": "God",
    "Killing": "They were created by God as a failsafe to destroy existence in case he failed in his own efforts.",
    "Description": "The Akrida are a species of monster not from Earth who have tried to invade multiple times in the past."
  },
  "Aliens": {
    "Origin": "Modern folklore",
    "Killing": "Not confirmed",
    "Description": "Aliens are extraterrestrial beings believed by some to visit or inhabit Earth. They are often featured in science fiction literature, films, and conspiracy theories."
  },
  "Alphas": {
    "Origin": "Eve",
    "Killing": "Depends on what species they are.",
    "Description": "Alphas are the first monsters of each species created by Eve. They are the Fathers of Fallen Beasts."
  },
  "Amazons": {
    "Origin": "Greek mythology",
    "Killing": "After mating, the child created must kill their father as a sign of initiation, they do this by first cutting off his limbs, and carving a symbol into his chest, before killing them. Children are taken at birth and trained and tortured in order to make them strong. Before their initiation, they have a mark burned into their skin. Any child who runs away may also be hunted down by other members.",
    "Description": "They were created by a meeting of the pagan deities Ares and Harmonia, creating a tribe of warrior women who had no need for males, except for reproduction. At some point, they had a war, and their numbers were vastly depleted, as such they made a deal with Harmonia to save them from extinction, and she made them more than human, effectively turning them into monsters. Unlike most other monsters, they are not descended from Eve and thus have no Alpha."
  },
  "Angels": {
    "Origin": "God",
    "Killing": "Angel blade and with their celestial/true form.",
    "Description": "Angels are celestial beings found in various religious traditions, often depicted as messengers of God or guardians of humans. They power Heaven and at full potential they are imbued with considerable power."
  },
  "Arachne": {
    "Origin": "Eve",
    "Killing": "Poisoning and feeding upon human flesh.",
    "Description": "An arachne is a creature that can create strong webs, just like real spiders can do, so they can trap their victims with ease. They are also capable of changing humans into arachne by biting them, in order to propagate their species."
  },
  "Archangels": {
    "Origin": "God",
    "Killing": "Weapons, like The Horn of Gabriel, The Sword of Michael, and with their celestial power and form that can cause natural disasters.",
    "Description": "Archangels are primordial angels that existed long before the creation of the Big Bang,[1] being looked at as Heaven's most fearsome wrath.[2] They were the first and strongest class of angels to be created, making them one of God's first creations. They were created in this order: Michael, Lucifer, Raphael, and Gabriel."
  },
  "Aswang": {
    "Origin": "Philippine folklore",
    "Killing": "They grow bat wings and preys on pregnant woman, eating the unborn baby inside.",
    "Description": "Aswang are mythical creatures in Philippine folklore, often depicted as shape-shifters and tricksters that prey on humans, particularly pregnant women and children. They mostly take an appearance of a beautiful young woman during the day, but can change their age and even species."
  },
  "Baku": {
    "Origin": "Japanese folklore",
    "Killing": "Legends say the Baku will come into the child's room and devour the bad dream, allowing the child to go back to sleep peacefully. However, calling to the Baku must be done sparingly, because if he remains hungry after eating one's nightmare, he may also devour their hopes and desires as well, leaving them to live an empty life.",
    "Description": "Baku are supernatural beings in Japanese folklore, often depicted as dream-eating creatures that can protect sleepers from nightmares."
  },
  "Banshee": {
    "Origin": "Irish and Scottish folklore",
    "Killing": " They use their piercing scream to drive their prey crazy. Once the human is dead, the malevolent banshees then feed on their frontal lobe.",
    "Description": "There exists two specific types: a benevolent one that wails in the night as a warning when someone is about to die, and a malevolent one that uses their supernatural screaming to drive humans insane and bash their own heads in."
  },
  "Bigfoot": {
    "Origin": "North American folklore",
    "Killing": "Not confirmed",
    "Description": "Bigfoot, also known as Sasquatch, is a legendary ape-like creature said to inhabit forests, particularly in the Pacific Northwest region of North America."
  },
  "Bisaan": {
    "Origin": "Malaysian folklore",
    "Killing": "Possession.",
    "Description": "Bisaan were said to have originated in the forests of Malaysia and are very rare in America. In their true forms they have no genitalia as a result they emerge from underground every 27 years and possess humans through the mouth, so they can mate and breed. "
  },
  "Black_Dogs": {
    "Origin": "European folklore",
    "Killing": "They have similarities with hell hounds and wendigos.",
    "Description": "Black Dogs are spectral or supernatural canines found in European folklore, often associated with death or the Devil."
  },
  "Borderwalker": {
    "Origin": "Trickster God",
    "Killing": "They are generally harmless and are left alone by hunters.",
    "Description": "A normal Borderwalker is a shape-shifter, able to take on aspects of various desert animals such as the coyote, the scorpion or the rattlesnake. Borderwalkers are only female, like the Amazons."
  },
  "Braydon_Albright": {
    "Origin": "Demon deal",
    "Killing": "Not confirmed",
    "Description": "Braydon Albright was a man who gained the power to shapeshift into a creature known as Sheepsquatch or the White Thing through unknown means."
  },
  "Buruburu": {
    "Origin": "Japanese folklore",
    "Killing": "Infects victims with ghost sickness.",
    "Description": "The Buruburu are ghosts born of a person's fear after dying in a terrifying manner. They can then infect others with their fear, and this infection is known as the Ghost Sickness. The people they infect are usually people who have made a habit of terrorizing others."
  },
  "Changelings": {
    "Origin": "European folklore",
    "Killing": "They feed on humans, specifically on synovial fluid. ",
    "Description": "Changelings are mythological beings in European folklore, believed to be fairy or demon children left in the place of human infants."
  },
  "Cherubim": {
    "Origin": "God",
    "Killing": "They are generally harmless and are left alone by hunters.",
    "Description": "also called Cupids by humans, are a type of angel that seem to be at the very bottom of Heaven's hierarchy. They are tasked with pairing important bloodlines together by means, as it is their chore."
  },
  "Chimera": {
    "Origin": "Greek mythology",
    "Killing": "Infection with their blood",
    "Description": "This Chimera, being constituted of multiple parts from multiple random animals and humans, are very formidable threats. Its mutation effects are also very dangerous, because it will transform human to human-animal hybrids to the point that cannot be recovered from."
  },
  "Chupacabra": {
    "Origin": "Latin American folklore",
    "Killing": "Not confirmed",
    "Description": "Chupacabra is a legendary creature in Latin American folklore, said to attack livestock and drain their blood, often described as resembling a reptilian or alien creature."
  },
  "Cloaked_Figures": {
    "Origin": "The Bad Place",
    "Killing": "Hunting and killing",
    "Description": "The cloaked figures look like humanoid monsters with glowing red eyes, clad in long black, ragged cloaks. They also cover their mouth with a crude mask that, when opened, exposes their predator-like face, covered in slime. When wounded, they expel thick blue blood."
  },
  "Creatures": {
    "Origin": "Unknown",
    "Killing": "Depends on what species they are.",
    "Description": "Creatures are non-human beings that have an unknown origin and/or are not descended from Eve. They come from various realms, have various powers and unique appearances."
  },
  "Croatoan_Virus": {
    "Origin": "Demonic virus",
    "Killing": "Infects people and turns them into murderous rabid creatures with varying degrees of intelligence, ranging from cruel and cunning to savage and mindless.",
    "Description": "The Croatoan Virus is a creation from the show, depicted as a demonic virus designed to turn humans into demons. The virus is spread by blood to blood contact and usually takes three to four hours for the symptoms and sulfur to manifest."
  },
  "Crocotta": {
    "Origin": "Medieval folklore",
    "Killing": "Mimic any person's voice to lure their victims out so they can feed.",
    "Description": "Crocotta is a mythical creature from medieval folklore, often depicted as a hybrid between a dog and a wolf, known for its ability to mimic human voices."
  },
  "Crossroad_Demon": {
    "Origin": "Lucifer",
    "Killing": "Making deals with humans in exchange for their souls",
    "Description": "Crossroad demons are a creation from the show, depicted as demons tasked with 'buying' souls for Hell through deals with humans. These deals consist of the demon granting the human's wish in exchange for ownership over that person's soul, resulting in the person dying and going to Hell to be transformed into a demon upon death."
  },
  "Cthulhu": {
    "Origin": "H.P. Lovecraft",
    "Killing": "Not confirmed",
    "Description": "Cthulhu is a cosmic entity created by H.P. Lovecraft, depicted as a monstrous, tentacled being worshipped by cultists. It is a central figure in Lovecraftian horror."
  },
  "Daeva": {
    "Origin": "Lucifer",
    "Killing": "Used by demons as invisible killers.",
    "Description": "A Daeva is an ancient demonic creature of shadow, a special type of demon, that can be summoned by other demons."
  },
  "Death_Echo": {
    "Origin": "Modern folklore",
    "Killing": "They are generally harmless and are left alone by hunters.",
    "Description": "A Death Echo is a type of trapped Ghost. The spirit is stuck reenacting its death over and over in a loop. Sometimes the spirit can be shocked into moving on, particularly by someone with whom the deceased has an emotional connection."
  },
  "Death_Omen": {
    "Origin": "Modern folklore",
    "Killing": "They are generally harmless and are left alone by hunters.",
    "Description": "While they appear violent and intimidating, they're not dangerous ghosts but rather are trying to warn people who may be murdered by the person who killed them. They are tied to the Earth because they wish to find out who killed them."
  },
  "Deities": {
    "Origin": "God",
    "Killing": "Some of them are neutral or indifferent to humans, but some are evil and enjoy and have a taste for human flesh and sacrifices.",
    "Description": "When we, humans first climbed down from the trees, we didn't pray to God. We prayed to the sun, the womb, the rain and the stars. And, at first, God was furious, but soon enough, he birthed Ra, Anu, Hera, Mixcoatl, and all the rest."
    },
  "Demigods": {
    "Origin": "Deities",
    "Killing": "Depends on what species they are.",
    "Description": "Demigods are the children of gods with a being of another species. An entire race such as the gorgons or tricksters can be demigods as well."
    },
  "Demons": {
    "Origin": "Lucifer",
    "Killing": "Engage in all sorts of torture and destruction.",
    "Description": "Demons are malevolent spiritual entities that are considered the direct opposites to angels. They are created from human souls who have endured prolonged extreme torture in Hell. Via this process, they become corrupted, extremely evil, and also very powerful."
    },
  "Disaster_Demon": {
    "Origin": "Lucifer",
    "Killing": "Engage in all sorts of torture and destruction.",
    "Description": "An unnamed demon caused disasters by crashing planes."
    },
  "Djinn": {
    "Origin": "Arabian mythology",
    "Killing": "They feed on human blood and can poison their victims with a touch. The poison can be used either to kill their victims quickly, or to leave victims in a coma-like state while the djinn feeds on their blood over a long period of time. ",
    "Description": "Djinns, also spelled Jinns and sometimes even called Genies (Jinni), are a rare race of supernatural cave dwelling hermits that have the power to produce powerful hallucinations inside the minds of humans."
    },
  "Dragons": {
    "Origin": "Eve",
    "Killing": "Eat female human virgins.",
    "Description": "Dragons are a very rare race of monsters that have not been hunted or even seen for over 700 years. In fact, they are so rare that most veteran hunters (like Bobby Singer) dismiss their existence as purely fictional."
    },
  "Edward_Trenton's_Species": {
    "Origin": "Unknown",
    "Killing": "Not confirmed",
    "Description": "Edward Trenton's Species refers to an unidentified and apparently very rare type of monster that Edward Trenton transformed into."
    },
  "Eleanor_Visyak's_Species": {
    "Origin": "Unknown",
    "Killing": "Not confirmed",
    "Description": "Eleanor Visyak's Species refers to an unidentified race of creature that Dr. Eleanor Visyak was a part of. Being the only one to appear, not much is known about this race."
    },
  "Elves": {
    "Origin": "Unknown",
    "Killing": "They are generally harmless and are left alone by hunters.",
    "Description": "Elves are a type of fairy."
    },
  "Eve": {
    "Origin": "God",
    "Killing": "Births harmful species",
    "Description": "Eve was a mysterious and powerful being known by the title of Mother of All. Eve was part of existence before angels and created the Alphas, which were the first monsters of their allotted kind from whom their entire species is descended."
    },
  "Fairies": {
    "Origin": "European folklore",
    "Killing": "Not confirmed",
    "Description": "Fairies are supernatural beings found in European folklore, often depicted as small, humanoid creatures with magical powers and a connection to nature. They are mischievous creatures that come in a variety of forms and that can only be seen by those who have been to their realm or if they choose to be seen. "
    },
  "Familiar": {
    "Origin": "European folklore",
    "Killing": "Follow their masters orders.",
    "Description": "Familiars are magical animals or spirits in European folklore believed to assist witches or wizards in their magical practices."
    },
  "Flying_Monkeys": {
    "Origin": "Oz",
    "Killing": "Follow their masters orders.",
    "Description": "Flying Monkeys are creatures native to Oz. They were under the control of the Wicked Witch."
    },
  "William_Foster": {
    "Origin": "Cannibalism",
    "Killing": "Wendigo style.",
    "Description": "William Foster is a member of the Donner Party who became a wendigo due to his cannibalism."
    },
  "Four_Horsemen_of_the_Apocalypse": {
    "Origin": "God",
    "Killing": "They drive the Apocalypse.",
    "Description": "The Four Horsemen of the Apocalypse are figures mentioned in the Book of Revelation in the Bible, representing War, Famine, Pestilence, and Death as harbingers of the end times."
  },
  "Ghosts": {
    "Origin": "Modern folklore",
    "Killing": "Ghosts are neither good nor evil, as their behavior is ultimately dictated by who they were in life and how they died. They can become violent and angry.",
    "Description": "Ghosts, also called Spirits, are souls of deceased humans and animals that did not go with their reaper to their respective afterlife and are stuck on Earth."
  },
  "Ghouls": {
    "Origin": "Arabian folklore",
    "Killing": "Feed on human flesh",
    "Description": "Ghouls are scavenger creatures that live in graveyards and traditionally feed on the flesh and blood of the dead. Ghouls are not nocturnal, they eat whenever they get the chance. At times ghouls will change their diet and will feed on living humans instead of the dead. Ghouls can also take the form of any person they have eaten, whether the person is still alive or already dead."
  },
  "Giant_(The_Bad_Place)": {
    "Origin": "The Bad Place",
    "Killing": "Not confirmed",
    "Description": "Not much is known about this creature except for its massive size."
  },
  "Giant_Alligator": {
    "Origin": "Modern folklore",
    "Killing": "Alligator style.",
    "Description": "Giant Alligators are enhanced reptilian creatures thought to only be an urban legend."
  },
  "Gog_and_Magog": {
    "Origin": "Biblical folklore",
    "Killing": "Conquer and enslave",
    "Description": "Gog and Magog are names that appear in the Bible, the Quran, and various mythological traditions. They were primitive humanoid creatures made of rock and sand who became ancient warriors."
  },
  "Gog_and_Magog's_Species": {
    "Origin": "Unknown",
    "Killing": "Conquer and enslave",
    "Description": "In Biblical times, the species was created by an unknown being. At least two members of the species received swords forged by a god. Supposedly, most of the species went extinct during the Great Flood with the only known survivors being Gog and Magog."
  },
  "Golem": {
    "Origin": "Jewish folklore",
    "Killing": "Follow their masters orders.",
    "Description": "Golems are animated beings created from inanimate matter, typically clay or mud, brought to life through mystical means to serve their creators."
  },
  "Gorgons": {
    "Origin": "Greek mythology",
    "Killing": "Snake style.",
    "Description": "Gorgons are demigods with serpentine characteristics and affinity for snakes, venomous snakes. The most famous Gorgon is Medusa, whose gaze could turn people to stone."
  },
  "Gorilla-wolves": {
    "Origin": "Unknown",
    "Killing": "Not confirmed",
    "Description": "Gorilla-wolves are monstrous creatures seen in Purgatory."
  },
  "Green-eyed_Demons": {
    "Origin": "Lucifer",
    "Killing": "Not confirmed",
    "Description": "The theoretical existence of green-eyed demons was implied when Sam and Dean investigated a case about the Bisaan. However, no further proof from the series were seen."
  },
  "Griffin": {
    "Origin": "Greek mythology",
    "Killing": "Not confirmed",
    "Description": "Griffins are mythical creatures with the body of a lion and the head and wings of an eagle. They are often depicted as guardians of treasures and sacred sites."
  },
  "Grigori": {
    "Origin": "Biblical folklore",
    "Killing": "Some say that they prey on people.",
    "Description": "Grigori, or Watchers, are fallen angels mentioned in the Book of Enoch. They are said to have descended to Earth and taught humans forbidden knowledge."
  },
  "Harpy": {
    "Origin": "Greek mythology",
    "Killing": "Kidnapped targets, ate them, buried their bodies in shallow graves and burned their belongings.",
    "Description": "Harpies are wind spirits depicted as winged women with sharp claws. They are known for their predatory nature."
  },
  "Hell_Ghosts": {
    "Origin": "Hell",
    "Killing": "Possession.",
    "Description": "The Hell Ghosts are the ghosts released by God from Hell when he began the end of the world."
  },
  "Hellhounds": {
    "Origin": "Hell",
    "Killing": "Tasked with collecting the souls of humans whose deals are come due.",
    "Description": "Hellhounds are supernatural dogs associated with the underworld. They are often depicted as large, black, and ferocious demon pit bulls, serving as a demons right hand. "
  },
  "Hybrid": {
    "Origin": "Depends on the parents",
    "Killing": "Depends on what species they are.",
    "Description": "A Hybrid is a cross between two species, one usually human."
  },
  "Jakkal": {
    "Origin": "Egyptian folklore",
    "Killing": "Their kind was known and respected by humans as servants of the great Anubis.",
    "Description": "Jakkals are a race of carrion-eating scavengers, similiar to ghouls. They are also renowned for their hatred toward werewolves."
  },
  "Jefferson_Starships": {
    "Origin": "Eve",
    "Killing": "They had the teeth of vampires and the spike of wraiths.",
    "Description": "Jefferson Starships, named by Dean Winchester, were new monster hybrids created by Eve as a test subject to see if she could create the ultimate supernatural predator."
  },
  "Jörmungandr": {
    "Origin": "Norse mythology",
    "Killing": "Not confirmed",
    "Description": "Jörmungandr, also known as the Midgard Serpent, is a giant sea serpent that encircles the world. It is destined to fight Thor during Ragnarok, the end of the world in Norse mythology."
  },
  "Kappa": {
    "Origin": "Japanese folklore",
    "Killing": "They protect humans from harm in exchange for food.",
    "Description": "Kappa are a helpful type of specter that originates from Japan. They are covered with scales, and have webbed hands and feet with sharp claw like fingers. Humanoid but turtle and frog-like in appearance, they also have big eyes and a large toothy smile."
  },
  "Khan_worm": {
    "Origin": "Eve",
    "Killing": "Entered into people's heads through their ears or mouth, and controlled their actions.",
    "Description": "The Khan Worms, named by Dean Winchester, was a new type of monster created by Eve."
  },
  "Kitsune": {
    "Origin": "Japanese folklore",
    "Killing": "They feed on the pituitary gland, a part of the brain, since without it, they will die.",
    "Description": "A kitsune is a monster that, in appearance, looks somewhat similar to werewolves, but with a more fox-like than wolf-like appearance. Kitsunes seem to be very rare and uncommon."
  },
  "Knights_of_Hell": {
    "Origin": "Lucifer",
    "Killing": "Engage in all sorts of torture and destruction.",
    "Description": "Knights of Hell are a creation from the show, depicted as elite demons created by Lucifer and trained by Cain, the original knight. The Knights are thought to be among the oldest and most powerful of their kind."
  },
  "Kohonta": {
    "Origin": "Modern folklore",
    "Killing": "Cannibalism",
    "Description": "A kohonta is a human who has been cursed into a creature of insatiable hunger for extreme acts of cannibalism."
  },
  "Kraken": {
    "Origin": "Norse mythology",
    "Killing": "Not confirmed",
    "Description": "The Kraken is a giant sea monster in Norse mythology, often depicted as a massive cephalopod capable of dragging entire ships under the sea."
  },
    "La_Tunda": {
      "Origin": "Colombian folklore",
      "Killing": "Lures and feeds on children.",
      "Description": "La Tunda is a mythological monster from Colombian folklore, depicted as a shapeshifting woman who lures people, especially children, into the forest to feed on them. It can have plant-like characteristics."
    },
    "Lamia": {
      "Origin": "Greek mythology",
      "Killing": "Lures and feeds on children.",
      "Description": "Lamia is a child-eating demon or monster in Greek mythology, often depicted as a beautiful woman who transforms into a serpent-like creature to prey on children."
    },
    "Lee's_Marid": {
      "Origin": "Islamic folklore",
      "Killing": "They feed on blood.",
      "Description": "Marids are powerful jinn in Islamic mythology, known for their strength and often depicted as rebellious and difficult to control."
    },
    "Leprechauns": {
      "Origin": "Irish folklore",
      "Killing": "Do not have an aversion to killing humans who get in their way.",
      "Description": "Leprechauns are small, bearded fairies in Irish folklore, known for their mischief and their pot of gold hidden at the end of a rainbow."
    },
    "Leviathans": {
      "Origin": "Biblical folklore",
      "Killing": "Hungry and destructive. Eat all.",
      "Description": "The Leviathans, also called Leviathan, The Old Ones, Chompers, or Levis for short, are a race of ancient, primordial monsters that served as God's very first beasts. Thus, they predate angels, humans, and the soul itself."
    },
    "Lizard_People": {
      "Origin": "Modern folklore",
      "Killing": "Not confirmed",
      "Description": "Lizard People refers to lizard-like beings that can disguise as humans. It's unknown if they're peaceful or malicious."
    },
    "Loch_Ness_Monster": {
      "Origin": "Scottish folklore",
      "Killing": "Not confirmed",
      "Description": "The Loch Ness Monster, or Nessie, is a cryptid said to inhabit Loch Ness in Scotland, often described as a large, long-necked creature."
    },
    "Loup-Garou": {
      "Origin": "Unknown",
      "Killing": "Not confirmed",
      "Description": "Loup-Garou are a species of monster that are bipedal reptilian/canines."
    },
    "Marid": {
      "Origin": "Islamic folklore",
      "Killing": "They feed on blood.",
      "Description": "A Marid is a type of creature that can grant riches and health in exchange for the blood of innocents."
    },
    "Moa'ah": {
      "Origin": "Native American folklore",
      "Killing": "They drive the Apocalypse.",
      "Description": "Moa'ah is a unique demonic breed of creature which is commonly found in Southern American. It's commonly found on land which supported massive carnage."
    },
    "Monster": {
      "Origin": "Eve",
      "Killing": "Prey on humans",
      "Description": "Monsters are the children and descendants of Eve, and other supernatural creatures. Although referring to many different species, some share a point of origin, and traits."
    },
    "Mothra": {
      "Origin": "Modern folklore",
      "Killing": "Not confirmed",
      "Description": "Mothra is a mythological creature, and may be connected to Leviathans and Purgatory in some way."
    },
    "Muscas": {
      "Origin": "Hybrids",
      "Killing": "Attack humans",
      "Description": "Muscas are hybrid-looking creatures between humans and flies."
    },
    "Myling": {
      "Origin": "Scandinavian folklore",
      "Killing": "They are the vengeful spirits of children who lure adults to their deaths with cries for help.",
      "Description": "Mylings are the ghosts of unbaptized children in Scandinavian folklore, often depicted as seeking revenge or proper burial from the living."
    },
    "Nachzehrer": {
      "Origin": "German folklore",
      "Killing": "Some breeds feed on the flesh of the dead. Others feed on the blood and hearts of the living.",
      "Description": "Nachzehrers were monsters that were similar to ghouls and vampires. Their existence was known since ancient Greece and by the Men of Letters. They can be cured by killing the pack alpha."
    },
    "Nephilim": {
      "Origin": "Biblical folklore",
      "Killing": "Whenever a Nephilim grew into their power, entire worlds died, the Nephilim is destinated to became more powerful than the angel that genereted them.",
      "Description": "Nephilim are the offspring of the 'sons of God' and the 'daughters of men' mentioned in the Bible, often depicted as giants or mighty warriors. The offspring contains a mixture of human soul and angelic grace as a source of power, inherited from both parents. "
    },
    "Neteru": {
      "Origin": "Egyptian folklore",
      "Killing": "Follow their masters orders.",
      "Description": "Neteru are zombie-like soulless guardians. They are created from reanimated corpses through a Jakkal bite."
    },
    "Night_Hag": {
      "Origin": "Polish folklore",
      "Killing": "Hunting and killing",
      "Description": "They were known to create and manipulate nightmares which would then materialize in the real world and go on killing sprees."
    },  
    "Obake": {
      "Origin": "Japanese folklore",
      "Killing": "They are generally harmless and are left alone by hunters.",
      "Description": "Obake, or 'bakemono,' are shapeshifting spirits or ghosts in Japanese folklore."
    },
    "Okami": {
      "Origin": "Japanese folklore",
      "Killing": "Hypnotism.",
      "Description": "Okami are Japanese wolf deities. They are often considered protectors of the mountains and are associated with the Shinto faith."
    },
    "Ondines": {
      "Origin": "Japanese folklore",
      "Killing": "Lures and feeds on sailors.",
      "Description": "Close to mermaids, the Ondine were creatures from the sea who took men, mainly sailors, away to feed. Live in close family units, the females do most of the hunting, while men guard the children and home."
    },
    "Oni": {
      "Origin": "Japanese folklore",
      "Killing": "Cause disasters and epidemics on a large scale.",
      "Description": "Oni are demons or ogres in Japanese mythology. They appear as normal humans for the most part but will eventually grow horns and claws and their third eye will open at an age of maturity."
    },
    "Orange-eyed_Demons": {
      "Origin": "Lucifer",
      "Killing": "Not confirmed",
      "Description": "Orange-eyed Demons are a rare type of demon mentioned in Bobby Singer's Guide to Hunting, Bobby himself never encountered one, but heard stories about it."
    },
    "Phoenix": {
      "Origin": "Greek mythology",
      "Killing": "Power to burn anyone into ash with a simple touch of its hand.",
      "Description": "Phoenixes were powerful monsters who appeared human and were very rare in existence, so rare that, much like dragons, they were believed to be mythical even by veteran hunters like Bobby Singer or Samuel Colt."
    },
    "Pishtaco": {
      "Origin": "Andean folklore",
      "Killing": "They are generally harmless and are left alone by hunters.",
      "Description": "Pishtaco is a mythological figure from Andean folklore, often depicted as a white man who preys on indigenous people, extracting their fat for various uses."
    },
    "Poltergeists": {
      "Origin": "Western folklore",
      "Killing": "Poltergeists are invisible and telekinetic spirits that uniquely seek attention through sometimes violent and deadly actions.",
      "Description": "Poltergeists are a type of spirit that seeks recognition and attention, and will do anything to receive it."
    },
    "Pontianak": {
      "Origin": "Malay and Indonesian folklore",
      "Killing": "Prey on humans",
      "Description": "Pontianak are vampiric female ghosts in Malay and Indonesian mythology, often depicted as beautiful women who prey on men and pregnant women. They are born from the spirits of women that died during childbirth."
    },
    "Primordial_Entities": {
      "Origin": "Unknown",
      "Killing": "All powerful, just like God.",
      "Description": "Primordial Entities or Cosmic Beings refer to a group of nigh- or lower-tier omnipotent beings who existed before the creation of the Universe."
    },
    "Princes_of_Hell": {
      "Origin": "Lucifer",
      "Killing": "Engage in all sorts of torture and destruction.",
      "Description": "The Princes of Hell were the first generation of demons created by Lucifer himself after the creation of Lilith. Lucifer created them himself before the sinking of Atlantis. In the demonic hierarchy of Hell, they ranked among the highest, eclipsed only by the original demon Lilith."
    },
    "Qareen": {
      "Origin": "Islamic mythology",
      "Killing": "Will take on the form of a person's deepest, darkest desire to seduce and then kill the victim.",
      "Description": "Qareens are a type of creature, similar to a genie, that can be controlled to do the bidding of a master, who is in possession of their heart."
    },
    "Rabid": {
      "Origin": "The Darkness",
      "Killing": "Infection with their blood",
      "Description": "Rabids, named by Sam Winchester, were a new kind of creature created by the Darkness by corrupting humans."
    },
    "Rakshasa": {
      "Origin": "Hindu folklore",
      "Killing": "Feed on human flesh",
      "Description": "Rakshasas it's a race of ancient Hindu creatures. They appear in human form, they feed on human flesh, they can make themselves invisible, and they cannot enter a home without first being invited."
    },
    "Rawhead": {
      "Origin": "English folklore",
      "Killing": "Prey on humans",
      "Description": "Rawhead is a boogeyman figure in English folklore, often used to frighten children into good behavior. They lurk in basements and preys upon children."
    },
    "Reapers": {
      "Origin": "Death",
      "Killing": "Delivering souls to their final destination.",
      "Description": "Reapers are beings that serve Death. They assist in maintaining The Natural Order and used to be thought as completely neutral, aligned with neither Heaven nor Hell nor Purgatory."
    },
    "Redcaps": {
      "Origin": "Scottish folklore",
      "Killing": "Prey on humans",
      "Description": "Redcaps are malevolent, goblin-like creatures in Scottish folklore, known for dyeing their hats with the blood of their victims."
    },
    "Revenant": {
      "Origin": "European folklore",
      "Killing": "Can eventually go wild, in which case hunters have to stop them.",
      "Description": "Revenants are reanimated corpses that return from the grave to terrorize the living. They are often associated with vengeance and unfinished business."
    },
    "Rit_Zien": {
      "Origin": "God",
      "Killing": "Painless",
      "Description": "On the battlefields of Heaven, there was a special class of angel. The Rit Zien. It's Enochian for 'hands of mercy.' They functioned like medics, they tended to the wounded, they healed those who could be healed. But for the mortally wounded, those who were past saving, the Rit Zien's job was to put them down."
    },
    "Rugaru": {
      "Origin": "Native American folklore",
      "Killing": "Feed on human flesh",
      "Description": "They start out human, for all intents and purpose. About age 30, they start changing, bones shift around, animal instincts kick in. But most of all, they're hungry. At first, for everything, but then for long pig."
    },  
    "Satyrs": {
      "Origin": "Greek mythology",
      "Killing": "Not confirmed",
      "Description": "Satyrs are half-human, half-goat creatures associated with Dionysus, the god of wine, fertility, and revelry. They are known for their love of music, dance, and hedonistic pleasures."
    },
    "Scaly_Thing": {
      "Origin": "God",
      "Killing": "Not confirmed",
      "Description": "The scaly thing was one of the first organisms that developed out of abiogenesis during the early phases of Earth."
    },
    "Selkies": {
      "Origin": "Irish and Scottish folklore",
      "Killing": "Not confirmed",
      "Description": "Selkies are shapeshifting monsters capable of assuming human form. They originated mainly in Scotland and nearby areas."
    },
    "Seraphim": {
      "Origin": "God",
      "Killing": "Angel blade and with their celestial/true form.",
      "Description": "eraphim are a higher class of angel, above normal angels such as Uriel and Joshua, but lower in status than archangels. Their exact role in Heaven is unclear. Akobel was sent to watch, observe and learn about humanity."
    },
    "Shadow_Spirit": {
      "Origin": "Erebus",
      "Killing": "Not confirmed",
      "Description": "A Shadow Spirit is an entity embedded in a magical artifact created by the deity Erebus in The Winchesters."
    },
    "Shapeshifters": {
      "Origin": "Eve",
      "Killing": "Prey on humans",
      "Description": "Shapeshifters, or just Shifters for short, are a species of monster that can take the form of any human being."
    },
    "Shedim": {
      "Origin": "Jewish folklore",
      "Killing": "Not confirmed",
      "Description": "Long ago, Asmodeus sought to please Lucifer by freeing the Shedim (Jewish demon name means benevolent one) as he believed that he could train and use them. However, since they were Hell's most savage creatures, even Lucifer feared the Shedim and subsequently locked them back up, and then scarred Asmodeus as punishment for disappointing him."
    },
    "Shtriga": {
      "Origin": "Albanian folklore",
      "Killing": "They feed of spiritus vitae. 'Breath of Life'.",
      "Description": "A shtriga is a kind of witch. They're Albanian, but legends about them date back to Ancient Rome."
    },
    "Shojo": {
      "Origin": "Japanese folklore",
      "Killing": "Kills by disemboweling",
      "Description": "SA Shojo is a Japanese alcohol spirit but is different in that it's corporeal and only those who are drunk can perceive them."
    },
    "Siren": {
      "Origin": "Greek mythology",
      "Killing": "Compel destructive or violent actions that usually result in death.",
      "Description": "Sirens are a type of supernatural creature that can take different forms to lure and compel humans to perform drastic acts to prove their love and devotion. Not much is known about them however, due to the fact that they are creatures rarely seen outside of Greece."
    },
    "Skinwalkers": {
      "Origin": "Alpha Skinwalker",
      "Killing": "Turn humans into one of them. Don't usually kill.",
      "Description": "Skinwalkers are supernatural dog-like monsters that originate from the Alpha Skinwalker."
    },
    "Sonja's_Qareen": {
      "Origin": "Islamic folklore",
      "Killing": "Will take on the form of a person's deepest, darkest desire to seduce and then kill the victim.",
      "Description": "The Qareen of Sonja. A witch."
    },
    "Soul_Eater": {
      "Origin": "Unknown",
      "Killing": "Prey on humans",
      "Description": "Soul eaters are ancient spiritual entities that live in another dimension and feed on human souls."
    },
    "Specter": {
      "Origin": "Modern folklore",
      "Killing": "Possession.",
      "Description": " Specter is a type of ghost that possesses the living and causes them to act on any grudges they may hold, no matter how small or old they may be. They are created when a person's death involves a betrayal, such as being killed by a brother. "
    },
    "Succubi": {
      "Origin": "Lucifer",
      "Killing": "Not confirmed",
      "Description": "n lore, succubi are a type of demon that sexually assault men in their sleep and drain them of energy; their male counterparts who do likewise to sleeping women are called incubi. It is said that after Lilith became a demon, she and Lucifer or Sammael had demonic children. These children were the succubi and incubi."
    },
    "Succubi_(Comics)": {
      "Origin": "Lucifer",
      "Killing": "Suck on male life force.",
      "Description": "According to John Winchester, Succubi are Hell's whores. They lure men into fits of ecstasy and then kill them by sucking out their life force, or so the legend goes."
    },
    "Vampires": {
      "Origin": "Alpha Vampire",
      "Killing": "They need fresh human blood to survive.",
      "Description": "ampires, or Vamps for short, are a race of blood-drinking supernatural creatures that were once human. They have been encountered by the Winchesters, Gordon Walker and other hunters. However it has been stated encountering a vampire is very rare as hunters have hunted them near to extinction although due to their ability to reproduce by transfusion, meaning that there only needs to be one for them to repopulate."
    },
    "Vengeful_Spirit": {
      "Origin": "Modern folklore",
      "Killing": "Vengence and anger.",
      "Description": "They are ghosts who have had some great wrong done to them in their lives (normally what killed them). This causes them to remain after death to try and avenge this wrong. Over time, they slowly become obsessed with this until it is the only thing they can think of. Bobby described it like 'an itch that you just can't scratch'."
    },
    "Vetala": {
      "Origin": "Eve",
      "Killing": "Hunting and killing",
      "Description": "Vetalas are a type of monster, almost snake-like, that hunt in pairs so they can capture their prey. They don't usually hunt solo. They also appear to be loyal and protective of their kind, obviously having a strong pack mentality that extends like family. Vetalas are a type of monster, almost snake-like, that hunt in pairs so they can capture their prey. They don't usually hunt solo. They also appear to be loyal and protective of their kind, obviously having a strong pack mentality that extends like family."
    },
    "Violent_Spirits": {
      "Origin": "Modern folklore",
      "Killing": "Prey on humans",
      "Description": "Unlike Vengeful Spirits, who are the ghosts of those who have some wrong done to them in their life, violent spirits are usually the ghosts of evil or cruel people (or at least had something wrong with them), who in their lives brought pain and suffering to others, and in their deaths continue to do so."
    },
    "Unicorns": {
      "Origin": "European folklore",
      "Killing": "Not confirmed",
      "Description": "A Unicorn, according to the lore, is a mythological horse creature that has been described since antiquity as a beast with a large, pointed, spiraling horn projecting from its forehead."
    },
    "Unnamed_Shojos": {
      "Origin": "Japanese folklore",
      "Killing": "Kills by disemboweling",
      "Description": "These unnamed shojos were shojos in Japan."
    },
    "Tempter_Demons": {
      "Origin": "Lucifer",
      "Killing": "Engage in all sorts of torture and destruction.",
      "Description": "Tempter Demons were a type of demon that existed in the Apocalypse World. How and if they vary from other demons aside from physical manifestations of horns and sharp teeth is currently unknown."
    },
    "The_Collectors": {
      "Origin": "Lucifer",
      "Killing": "Engage in all sorts of torture and destruction.",
      "Description": "The Collectors is a race of Hell-dwelling spirit like creatures. Many of its worked under Judas Iscariot, while some other work under other demons, or even humans, by though deal for latter."
    },
    "The_Giant_(The_Bad_Place)": {
      "Origin": "The Bad Place",
      "Killing": "Not confirmed",
      "Description": "Not much is known about this creature except for its massive size."
    },
    "The_Shadow_People": {
      "Origin": "Modern folklore",
      "Killing": "Not confirmed",
      "Description": "While the novel refer the creature as 'The Shadow People', Sam, Dean, and others referred them as 'Shade(s)' or 'Shadow(s)', as nobody know the proper name of the species of ghost."
    },
    "Tinks": {
      "Origin": "European folklore",
      "Killing": "Not confirmed",
      "Description": "At first, they appear to just be hovering orbs of bright light, but they are actually little beings that are naked, beautiful women with wings that shine like tinkles."
    },
    "Tooth_Fairies": {
      "Origin": "Western folklore",
      "Killing": "Not confirmed",
      "Description": "Tooth fairies, as all fairies in general, are believed to not be real even among most hunters and other people aware of the supernatural world like Bela Talbot."
    },
    "Tricksters": {
      "Origin": "God",
      "Killing": "Accomplishes its destructive feats via unusual and often humorous means, its intent to humble the self-important.",
      "Description": "Tricksters are a type of mischievous gods with the ability to warp reality and make realistic objects and people out of thin air."
    },
    "Trogs": {
      "Origin": "Modern folklore",
      "Killing": "Eat to survive.",
      "Description": "Trogs are prehistoric humanoid creatures that reside in depth of Mammoth Cave, Brownsdale, Kentucky."
    },
    "Tulpa:_Tibetan_Spirit_Sigil": {
      "Origin": "Tibetan Buddhism",
      "Killing": "Depends on the belief behind them.",
      "Description": "A Tulpa can be created by many people concentrating on one thing while looking at a Tibetan Spirit Sigil. Once created, a Tulpa takes on a life of its own and no longer needs people to believe in it."
    },
    "Twigs_and_Twine_Clones": {
      "Origin": "Demon deal",
      "Killing": "Not confirmed",
      "Description": "A borrower witch who made a deal with a demon managed to gain access to a powerful spell that allowed her to animate twigs and twine dolls to appear and act exactly like an intended target. The witch created clones for every victim she killed, using their hearts as a key ingredient for the spell."
    },
    "Tzitzimimeh": {
      "Origin": "Aztec mythology",
      "Killing": "Prey on humans",
      "Description": "Tzitzimimeh are star deities and skeletal figures associated with darkness and chaos. They are believed to descend to earth during solar eclipses to devour humans."
    }
  }
  